Revit 2027 API
BuiltInFailures.ElectricalFailures.CircuitOverload Property
 Total connected apparent power for Circuit [Name] is exceeding 80% of the defined rating ([Rating Value]).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CircuitOverload { get; }
Public Shared ReadOnly Property CircuitOverload As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CircuitOverload {
	FailureDefinitionId^ get ();
}
static member CircuitOverload : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace